# Append Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArray..::..Append Method
VertexIndexPairArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	VertexIndexPair item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As VertexIndexPair _
)
```

Visual C++
---
```text
public:
virtual void Append(
	VertexIndexPair^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..VertexIndexPair
# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace